app/controllers/admin/dashboard_controller.rb

  def index
    @posts_count = Post.all.size
    @comments_count = Comment.all.size
    @visited_count = Post.all.inject(0) { |res, p| res + p.visited_count }
---
SELECT `posts`.* FROM `posts`
SELECT COUNT(*) FROM `posts`
SELECT COUNT(*) FROM `comments`