app/controllers/admin/posts_controller.rb

  def create
    labels = params.delete(:labels).to_s
    #@post = Post.new( params.permit(:title, :content, :type) )
    @post = Post.new(params.permit(:title, :content, :type))
  #  params.require(:post).permit(:title, :content)
    #@post = Post.new(post_params)
    initialize_or_create_labels(labels)

    if @post.save
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "網管日誌建好了，有修改請在此紀錄，謝謝。"], ["content", "如題，為方便溝通請在此留言。"], ["created_at", "2021-06-07 01:45:15.161215"], ["updated_at", "2021-06-07 01:45:15.161215"]]

  def update
    @post = Post.find( params[:id] )

    labels = params.delete(:labels).to_s
    initialize_or_create_labels(labels)

    if @post.update( params.permit(:title, :content, :type) )
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["title", "先傑網路拓樸圖"], ["content", "\r\n![先傑網路拓樸圖](/uploads/photo/image/1/topology.jpg)\r\n最後更新: 110/05/12 #介吾"], ["updated_at", "2021-06-07 03:33:12.836616"], ["id", 2]]

  def initialize_or_create_labels(labels)
    @post.labels = []
    labels.split(",").map { |i| i.strip }.uniq.each do |name|
      label = Label.find_or_initialize_by(name: name.strip)
      label.save!
      @post.labels << label
---
SELECT  `labels`.* FROM `labels` WHERE `labels`.`name` = 'nba' LIMIT 1
INSERT INTO "labels" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "test"], ["created_at", "2021-06-07 01:45:15.145975"], ["updated_at", "2021-06-07 01:45:15.145975"]]
INSERT INTO "labels_posts" ("label_id", "post_id") VALUES ($1, $2)  [["label_id", 2], ["post_id", 1]]