app/views/admin/posts/_form.html.erb

      <span>
        <% Label.all.each do |label| %>
---
SELECT `labels`.* FROM `labels`