app/models/post.rb

  def visited
    self.visited_count += 1
    self.save
---
UPDATE "posts" SET "visited_count" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["visited_count", 1], ["updated_at", "2021-06-07 01:45:33.605140"], ["id", 1]]

  def labels_content( need_blank=false )
    content = self.labels.collect { |label| label.name }.join(", ")
---
SELECT "labels".* FROM "labels" INNER JOIN "labels_posts" ON "labels"."id" = "labels_posts"."label_id" WHERE "labels_posts"."post_id" = $1  [["post_id", 1]]

  def liked_count
    self.likes.size
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 1]]

  def liked_by?(like_id)
    !! self.likes.where(id: like_id).first
---
SELECT  "likes".* FROM "likes" WHERE "likes"."post_id" = $1 AND "likes"."id" IS NULL ORDER BY "likes"."id" ASC LIMIT $2  [["post_id", 1], ["LIMIT", 1]]